---
title: MEPBuildingConstruction
classe: Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# MEPBuildingConstruction

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Construction GetBuildingConstruction(ConstructionType)` | `mEPBuildingConstruction.GetBuildingConstruction(constructionType)` | Construction |
| `Boolean GetBuildingConstructionOverride(ConstructionType)` | `mEPBuildingConstruction.GetBuildingConstructionOverride(constructionType)` | Boolean |
| `ICollection<Construction> GetConstructions(ConstructionType)` | `mEPBuildingConstruction.GetConstructions(constructionType)` | ICollection<Construction> |
| `Void SetBuildingConstruction(ConstructionType, Construction)` | `mEPBuildingConstruction.SetBuildingConstruction(constructionType, buildingConstruction)` | Void |
| `Void SetBuildingConstructionOverride(ConstructionType, Boolean)` | `mEPBuildingConstruction.SetBuildingConstructionOverride(constructionType, override)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```